---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.SketchCannotBeAutomaticallyDimensioned
source: html/d0fa093d-a40d-b55d-27e7-98583b4503b0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.SketchCannotBeAutomaticallyDimensioned Property

Sketch can't be Automatically Dimensioned - this is a prerequisite for Labeled Dimensions to work properly.

## Syntax (C#)
```csharp
public static FailureDefinitionId SketchCannotBeAutomaticallyDimensioned { get; }
```